app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def profile
    token =  request.headers[:Authorization].split(' ').last
    decoded_token = JsonWebToken.decode(token)
    p ".................authorizing............................"
    id = decoded_token['user_id']
    user = User.find(id)