app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    @driver = Driver.create(driver_params)
---
INSERT INTO "drivers" ("name", "username", "phone_number", "photo", "description", "rate", "car", "car_photo", "rating", "off_duty", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"