app/controllers/flat_rates_controller.rb

  def index
    @flat_rates = FlatRate.all
---
SELECT "flat_rates".* FROM "flat_rates"