app/controllers/trips_controller.rb

INSERT INTO "trips" ("driver_id", "user_id", "time_booked", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["driver_id", 3], ["user_id", 1], ["time_booked", "3"], ["total", 300.0], ["created_at", "2019-09-26 18:46:22.151170"], ["updated_at", "2019-09-26 18:46:22.151170"]]
---
  def create
   @trip = Trip.create(trip_params)